hoahiepnguyen/STM32F7_RTOS_dev/Sources/main.c
/**
	******************************************************************************
	* @file    UART/UART_TwoBoards_ComIT/Src/main.c 
	* @author  MCD Application Team
	* @brief   This sample code shows how to use UART HAL API to transmit
	*          and receive a data buffer with a communication process based on
	*          IT transfer. 
	*          The communication is done using 2 Boards.
	******************************************************************************
	* @attention
	*
	* <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
	*
	* Redistribution and use in source and binary forms, with or without modification,
	* are permitted provided that the following conditions are met:
	*   1. Redistributions of source code must retain the above copyright notice,
	*      this list of conditions and the following disclaimer.
	*   2. Redistributions in binary form must reproduce the above copyright notice,
	*      this list of conditions and the following disclaimer in the documentation
	*      and/or other materials provided with the distribution.
	*   3. Neither the name of STMicroelectronics nor the names of its contributors
	*      may be used to endorse or promote products derived from this software
	*      without specific prior written permission.
	*
	* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
	* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
	* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
	* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
	* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
	* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
	* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
	* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
	* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
	* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
	*
	******************************************************************************
	*/

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "log.h"
#include "cmsis_os.h"
#include "stm32f7xx_it.h"
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
/** @addtogroup STM32F7xx_HAL_Examples
	* @{
	*/

/** @addtogroup UART_TwoBoards_ComIT
	* @{
	*/ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define I2C_TIMING              0x40912732
#define STM32F7_ADDRESS         0xD0
#define CYPRESS_ADDR            0x37
#define STA321MP_ADDR           0x40

#define UPDATE_INTERVAL 		15 //refresh rate: 1/0.015ms = 66Hz
#define TASK_INTERVAL			5000
/* Private variables ---------------------------------------------------------*/
__IO uint32_t UserButtonStatus = 0;  /* set to 1 after User Button interrupt  */
__IO ITStatus Uart6_TxReady = RESET;
__IO ITStatus Uart6_RxReady = RESET;

osThreadId led_ring_ThreadId;
osThreadId i2c_master_ThreadId;
osThreadId i2c_slave_ThreadId;
osThreadId uart_receive_ThreadId;
osThreadId uart_transmit_ThreadId;
osThreadId pwm_tim2_ThreadId;

uint8_t aTxBuffer[] = "hey Dark";
uint8_t aRxBuffer[RXBUFFERSIZE];
I2C_HandleTypeDef I2c1Handle;
I2C_HandleTypeDef I2c2Handle;
UART_HandleTypeDef Uart6Handle;

osTimerId  xTimerUpdate;
osThreadId MainHandler;
osThreadId xCircularRingHandler;
osThreadId xHeartBeatHandler;
osThreadId xAllColorsHandler;
osThreadId xColorWheelHandler;
osThreadId xPatternMoveHandler;
osThreadId xFullEmptyHandler;
osThreadId xAlternateColorsHandler;

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void Error_Handler(void);
static void CPU_CACHE_Enable(void);
static void led_ring_Thread(void const *argument);
static void i2c_master_Thread(void const *argument);
static void i2c_slave_Thread(void const *argument);
static void uart_receive_Thread(void const * argument);
static void uart_transmit_Thread(void const * argument);

static void led_control_Thread(void const * argument);

static void CircularRing_Task(void const * argument);
static void HeartBeat_Task(void const * argument);
static void AllColors_Task(void const * argument);
static void ColorWheel_Task(void const * argument);
static void PatternMove_Task(void const * argument);
static void FullEmpty_Task(void const * argument);
static void AlternateColors_Task(void const * argument);

/* Private functions ---------------------------------------------------------*/

void UART6_Init(void)
{
	static DMA_HandleTypeDef hdma_tx;
	static DMA_HandleTypeDef hdma_rx;

	GPIO_InitTypeDef    GPIO_InitStruct;

	/** UART6 GPIO configuration
		PC6 ------> UART6_TX
		PC7 ------> UART6_RX
	*/
	/* Enable GPIO TX/RX clock */
	USART6_TX_GPIO_CLK_ENABLE();
	USART6_RX_GPIO_CLK_ENABLE();

	/* Enable USARTx clock */
	USART6_CLK_ENABLE();

  	/* Enable DMA clock */
  	DMAx_CLK_ENABLE();

	/* UART TX GPIO pin configuration  */
	GPIO_InitStruct.Pin       = USART6_TX_PIN;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull      = GPIO_PULLUP;
	GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = USART6_TX_AF;

	HAL_GPIO_Init(USART6_TX_GPIO_PORT, &GPIO_InitStruct);

	/* UART RX GPIO pin configuration  */
	GPIO_InitStruct.Pin = USART6_RX_PIN;
	GPIO_InitStruct.Alternate = USART6_RX_AF;

	HAL_GPIO_Init(USART6_RX_GPIO_PORT, &GPIO_InitStruct);


	/*##-3- Configure the DMA ##################################################*/
	/* Configure the DMA handler for Transmission process */
	hdma_tx.Instance                 = USART6_TX_DMA_STREAM;
	hdma_tx.Init.Channel             = USART6_TX_DMA_CHANNEL;
	hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
	hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
	hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
	hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
	hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
	hdma_tx.Init.Mode                = DMA_NORMAL;
	hdma_tx.Init.Priority            = DMA_PRIORITY_LOW;

	HAL_DMA_Init(&hdma_tx);

