hoahiepnguyen/STM32F7_RTOS_dev/Sources/main.c
		osThreadResume(xAllColorsHandler);
		osDelay(10000);
		osThreadSuspend(xAllColorsHandler);

		osThreadResume(xColorWheelHandler);
		osDelay(TASK_INTERVAL);
		osThreadSuspend(xColorWheelHandler);

		osThreadResume(xPatternMoveHandler);
		osDelay(TASK_INTERVAL);
		osThreadSuspend(xPatternMoveHandler);

		osThreadResume(xFullEmptyHandler);
		osDelay(TASK_INTERVAL);
		osThreadSuspend(xFullEmptyHandler);

		osThreadResume(xAlternateColorsHandler);
		osDelay(TASK_INTERVAL);
		osThreadSuspend(xAlternateColorsHandler);

//		osDelayUntil(&PreviousWakeTime, 1000);
	}
}

static void CircularRing_Task(void const * argument) {
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		stripEffect_CircularRing(50, 0, 0, 20);
	}

}

static void HeartBeat_Task(void const * argument) {
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		stripEffect_HeartBeat(700, 64, 0, 16);
	}

}

static void AllColors_Task(void const * argument) {
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		stripEffect_AllColors(10);
	}
}

static void ColorWheel_Task(void const * argument) {
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		stripEffect_ColorWheel(50);
	}
}

static void PatternMove_Task(void const * argument) {
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		stripEffect_PatternMove(50, 2, 10, 10, 10);
	}
}

static void FullEmpty_Task(void const * argument) {
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		stripEffect_FullEmpty(50, 20, 20, 20);
	}
}

static void AlternateColors_Task(void const * argument) {
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		stripEffect_AlternateColors(1000, 10, 50, 0, 0, 0, 0, 50);
	}
}

/**
	* @brief  Toggle LED1 thread
	* @param  Thread not used
	* @retval None
	*/
static void i2c_master_Thread(void const *argument)
{
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	aTxBuffer[0] = 0x00; //address reg
	aTxBuffer[1] = 0x01; //data

	for(;;)
	{
		BSP_LED_On(LED1);
		// /* Wait for USER button press before starting the Communication */
		// while(BSP_PB_GetState(BUTTON_KEY) != 1)
		// {

		// }

		// /* wait for USER button release before starting the Communication */
		// while(BSP_PB_GetState(BUTTON_KEY) != 0)
		// {
		// }

		/*## Start the transmission process #####################################*/  
		/* While the I2C in reception process, user can transmit data through 
		 "aTxBuffer" buffer */
		while(HAL_I2C_Master_Transmit_IT(&I2c2Handle, (uint16_t)CYPRESS_ADDR, (uint8_t*)aTxBuffer, 2)!= HAL_OK)
		{
		/* Error_Handler() function is called when Timeout error occurs.
		   When Acknowledge failure occurs (Slave don't acknowledge it's address)
		   Master restarts communication */
			if (HAL_I2C_GetError(&I2c2Handle) != HAL_I2C_ERROR_AF)
			{
				Error_Handler();
			}
		}
		BSP_LED_Off(LED1);

		/*## Wait for the end of the transfer ###################################*/  
		/*  Before starting a new communication transfer, you need to check the current   
		  state of the peripheral; if it’s busy you need to wait for the end of current
		  transfer before starting a new one.
		  For simplicity reasons, this example is just waiting till the end of the 
		  transfer, but application may perform other tasks while transfer operation
		  is ongoing. */  
		while (HAL_I2C_GetState(&I2c2Handle) != HAL_I2C_STATE_READY)
		{
		}
		// /* Wait for USER Button press before starting the Communication */
		// while (BSP_PB_GetState(BUTTON_KEY) != 1)
		// {
		// }

		// /* Wait for USER Button release before starting the Communication */
		// while (BSP_PB_GetState(BUTTON_KEY) != 0)
		// {
		// }

		/*## Put I2C peripheral in reception process ###########################*/  
		if (HAL_I2C_Master_Receive_IT(&I2c2Handle, (uint16_t)CYPRESS_ADDR, (uint8_t *)aRxBuffer, 2) == HAL_OK)
		{
			BSP_LED_On(LED1);
			printf("I2C_MASTER: aRxBuffer[0] = %x\r\n", aRxBuffer[0]);
			printf("I2C_MASTER: aRxBuffer[1] = %x\r\n", aRxBuffer[1]);
		}
		else
		{
			osDelayUntil(&PreviousWakeTime, 100);
		}

	}

}

/**
	* @brief  Toggle LED1 thread
	* @param  Thread not used
	* @retval None
	*/
static void i2c_slave_Thread(void const *argument)
{
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		if(HAL_I2C_Slave_Receive_DMA(&I2c1Handle, (uint8_t *)aRxBuffer, 2) == HAL_OK)
		{
			BSP_LED_On(LED1);
			printf("%x\r\n", aRxBuffer[0]);
			printf("%x\r\n", aRxBuffer[1]);
		}
		else
		{
			osDelayUntil(&PreviousWakeTime, 100);
		}
	}
}

static void led_ring_Thread(void const *argument)
{
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		osDelayUntil(&PreviousWakeTime, 1000);
		printf("led ring\r\n");
	}
}

static void uart_receive_Thread(void const * argument)
{
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();
	int i;

	printf("run here\r\n");
	for(;;)
	{
		/* Clear buffer before receiving */
		for(i=0; i<4; i++)
		{
		  aRxBuffer[i] = 0;
		}
		/* Reset transmission flag */
		Uart6_RxReady = RESET;

		if(HAL_UART_Receive_DMA(&Uart6Handle, (uint8_t *)aRxBuffer, 4) != HAL_OK)
		{
			Error_Handler();
		}
		// if(Uart6_Receive_DMA((uint8_t *)aRxBuffer, 4) < 0)
		// {
		// 	Error_Handler();
		//}
		while (Uart6_RxReady != SET)
		{
//			printf("wait here\r\n");
		}
		if(aRxBuffer[0] == 66)
		{
			printf("receive 'B' string\r\n");
		}
		if(aRxBuffer[1] == 76)
		{
			printf("receive 'L' string\r\n");
		}
		if(aRxBuffer[2] == 48)
		{
			printf("receive '0' string\r\n");
		}
		if(aRxBuffer[3] == 49)
		{
			printf("receive '1' string\r\n");

		}
		// /* Keyword "N" */
		// if(aRxBuffer[4] == 78)
		// {
		// 	 Set value to 1 for sending to Beaglebone
		// 	UserButtonStatus = 1;
		// }
		printf("done\r\n");
		osDelayUntil(&PreviousWakeTime, 1000);
	}
}

static void uart_transmit_Thread(void const * argument)
{
	(void) argument;
	uint32_t PreviousWakeTime = osKernelSysTick();

	for(;;)
	{
		/* Wait for User push-button press before starting the Communication.
		   In the meantime, LED1 is blinking */
		while(UserButtonStatus == 0)
		{
			/* Toggle LED1*/
			BSP_LED_Toggle(LED1); 
		}
  
		/* Reset transmission flag */
		Uart6_TxReady = RESET;

		// if(HAL_UART_Transmit_DMA(&Uart6Handle, (uint8_t *)aTxBuffer, TXBUFFERSIZE) != HAL_OK)
		// {
		// 	Error_Handler();
		// }

		while (Uart6_TxReady != SET)
		{
		}
		/* Reset value for next step */
		UserButtonStatus = 0;

		osDelayUntil(&PreviousWakeTime, 1000);
	}
}
/**
	* @brief  System Clock Configuration
	*         The system Clock is configured as follow : 
	*            System Clock source            = PLL (HSE)
	*            SYSCLK(Hz)                     = 216000000
	*            HCLK(Hz)                       = 216000000
	*            AHB Prescaler                  = 1
	*            APB1 Prescaler                 = 4
	*            APB2 Prescaler                 = 2
	*            HSE Frequency(Hz)              = 25000000
	*            PLL_M                          = 25
	*            PLL_N                          = 432
	*            PLL_P                          = 2
	*            PLL_Q                          = 9
	*            VDD(V)                         = 3.3
	*            Main regulator output voltage  = Scale1 mode
	*            Flash Latency(WS)              = 7
	* @param  None
	* @retval None
	*/
void SystemClock_Config(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;
	HAL_StatusTypeDef ret = HAL_OK;

	/* Enable HSE Oscillator and activate PLL with HSE as source */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 25;
	RCC_OscInitStruct.PLL.PLLN = 432;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 9;
	
	ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
	if(ret != HAL_OK)
	{
		while(1) { ; }
	}
	
	/* Activate the OverDrive to reach the 216 MHz Frequency */  
	ret = HAL_PWREx_EnableOverDrive();
	if(ret != HAL_OK)
	{
		while(1) { ; }
	}

	/* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
	RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;  
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2; 

